ProgessBase/InformationRegisters/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихКодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоЕдиницеИзмеренияКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПРГНеИскатьПоМКЮ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/НоменклатураКонтрагентов/Ext/RecordSetModule.bsl
//++ Spl_Апроф 06.02.2015 (k.russkih@a-prof.ru) Добавил ресурс "КоличествоПоЕдиницеИзмеренияКонтрагента" для загрузки заказов в разных единицах

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Номенклатура.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Нельзя записывать с незаполненным значением номенклатуры.");
			Продолжить;
		КонецЕсли; 
		
		Если Запись.Номенклатура.ЭтоГруппа Тогда
			Отказ = Истина;
			Сообщить("Нельзя выбирать группу номенклатуры в качестве номенклатуры контрагента.");
			Продолжить;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Контрагент = &Контрагент
	|	И НоменклатураКонтрагентов.КодНоменклатурыКонтрагента = &Код
	|	И НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента = &Артикул
	|	И НоменклатураКонтрагентов.ШтрихКодНоменклатурыКонтрагента = &Штрихкод
	|	И НоменклатураКонтрагентов.Отделение = &Отделение
	|	И НоменклатураКонтрагентов.Приоритет = &Приоритет");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запрос.УстановитьПараметр("Контрагент",	Запись.Контрагент);
		Запрос.УстановитьПараметр("Код", 		Запись.КодНоменклатурыКонтрагента);
		Запрос.УстановитьПараметр("Артикул", 	Запись.АртикулНоменклатурыКонтрагента);
		Запрос.УстановитьПараметр("Штрихкод", 	Запись.ШтрихКодНоменклатурыКонтрагента);
		Запрос.УстановитьПараметр("Приоритет", 	Запись.Приоритет);
		Запрос.УстановитьПараметр("Отделение",	Запись.Отделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Количество > 1 Тогда
			#Если Клиент Тогда
			Сообщить("Нельзя регистрировать больше одной записи по сочетанию <код контрагента> : <артикул контрагента> : <штрихкод контрагента> : <отделение> : <приоритет>!");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
